import java.util.Scanner;

public class ComputeTax
{
	public static void main(String[] args)
	{
		Scanner input=new Scanner(System.in);

		System.out.print("1.单身纳税人\n2.已婚共同纳税人\n3.已婚单身纳税人\n4.家庭户主纳税人\n\n请输入你的身份:");
		int status=input.nextInt();

		System.out.print("请输入你的可征税收入:");
		double money=input.nextDouble();
		double tax=0.0;
		if(status==1)
		{
			if(money<=8350) tax=money*0.1;
			if(money>8350&&money<=33950) tax=(money-8350)*0.15+835;
			if(money>33950&&money<=82250) tax=(money-33950)*0.25+835+(33950-8350)*0.15;
			if(money>82250&&money<=171550) tax=(money-82250)*0.28+835+(33950-8350)*0.15+(82250-33950)*0.25;
			if(money>171550&&money<372950) tax=(money-171550)*0.33+835+(33950-8350)*0.15+(82250-33950)*0.25+(171550-82250)*0.28;
			if(money>372950) tax=(money-372950)*0.35+(372950-171550)*0.33+835+(33950-8350)*0.15+(82250-33950)*0.25+(171550-82250)*0.28;
		}

		if(status==2)
		{
			if(money<=16700) tax=money*0.1;
			if(money>16700&&money<=67900) tax=(money-16700)*0.15+1670;
			if(money>67900&&money<=137050) tax=(money-67900)*0.25+1670+(67900-16700)*0.15;
			if(money>137050&&money<=208850) tax=(money-137050)*0.28+1670+(67900-16700)*0.15+(137050-67900)*0.25;
			if(money>208850&&money<372950) tax=(money-208850)*0.33+1670+(67900-16700)*0.15+(137050-67900)*0.25+(208850-137050)*0.28;
			if(money>372950) tax=(money-372950)*0.35+(372950-208850)*0.33+1670+(67900-16700)*0.15+(137050-67900)*0.25+(208850-137050)*0.28;
		}

		if(status==3)
		{
			
			if(money<=8350) tax=money*0.1;
			if(money>8350&&money<=33950) tax=(money-8350)*0.15+835;
			if(money>33950&&money<=68525) tax=(money-33950)*0.25+835+(33950-8350)*0.15;
			if(money>68525&&money<=104425) tax=(money-68525)*0.28+835+(33950-8350)*0.15+(68525-33950)*0.25;
			if(money>104425&&money<186475) tax=(money-104425)*0.33+835+(33950-8350)*0.15+(68525-33950)*0.25+(104425-68525)*0.28;
			if(money>186476) tax=(money-186476)*0.35+(186475-104425)*0.33+835+(33950-8350)*0.15+(68525-33950)*0.25+(104425-68525)*0.28;
		}

		if(status==4)
		{
			
			if(money<=8350) tax=money*0.1;
			if(money>8350&&money<=33950) tax=(money-8350)*0.15+835;
			if(money>33950&&money<=68525) tax=(money-33950)*0.25+835+(33950-8350)*0.15;
			if(money>68525&&money<=104425) tax=(money-68525)*0.28+835+(33950-8350)*0.15+(68525-33950)*0.25;
			if(money>104425&&money<186475) tax=(money-104425)*0.33+835+(33950-8350)*0.15+(68525-33950)*0.25+(104425-68525)*0.28;
			if(money>186476) tax=(money-186476)*0.35+(186475-104425)*0.33+835+(33950-8350)*0.15+(68525-33950)*0.25+(104425-68525)*0.28;
		}

		System.out.println("The tax is "+(int)(tax*100.0)/100.0);

	}
}